app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("created_at", "movie_id", "rating_out_of_ten", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @review = @movie.reviews.build(review_params)
    @review.user_id = current_user.id
    if @review.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? ORDER BY "movies"."id" ASC LIMIT 1  [["id", 2]]
---
  def load_movie
    @movie = Movie.find(params[:movie_id])